import streamlit as st
import pandas as pd
from io import BytesIO

st.set_page_config(page_title="Data Extractor", layout="wide")

st.title("Excel Data Extractor")

# Mapping الشيتات بالأعمدة الخاصة بيها
SHEET_STRUCTURE = {
    "Damen's complaint": [
        "مزود_الخدمة_الاساسي",
        "معلومات_اضافية",
        "الرقم_المرجعي",
        "تاريخ_الانشاء",
        "القيمة_الكلية",
        "رقم_العملية",
        "اسم_الخدمة",
        "كود_التاجر",
        "اسم_التاجر",
        "اسم_المحافظة",
    ],
    "Cases V.f cash": [
        "معلومات_اضافية",
        "الرقم_المرجعي",
        "تاريخ_الانشاء",
        "القيمة_الكلية",
        "رقم_العملية",
        "كود_التاجر",
        "اسم_التاجر",
        "اسم_المحافظة",
    ],
    "Orange cash": [
        "معلومات_اضافية",
        "الرقم_المرجعي",
        "تاريخ_الانشاء",
        "القيمة_الكلية",
        "رقم_العملية",
        "كود_التاجر",
        "اسم_التاجر",
        "اسم_المحافظة",
    ],
    "Etisalat Cash": [
        "معلومات_اضافية",
        "الرقم_المرجعي",
        "تاريخ_الانشاء",
        "القيمة_الكلية",
        "رقم_العملية",
        "كود_التاجر",
        "اسم_التاجر",
        "اسم_المحافظة",
    ],
    "Successful Receipt": [
        "مزود_الخدمة_الاساسي",
        "تاريخ_الانشاء",
        "القيمة_الكلية",
        "معلومات_اضافية",
